<h1 align="center">Computational Methods in Environmental Engineering</h1>
<h2 align="center">Lecture #9</h2>
<h3 align="center">21 Mar 2023</h3>

## MAP feedback

- Extend office hours to cover some Python basics
- Version control
- Going through some problems with whole class

## Getting started with pandas

-   `pandas` is primarily designed to work with tabular and heterogeneous data
-   Adopts parts of `Numpy`'s functionality (array-based computations)
-   Data labeling and alignment and integrated handling of missing data
-   Aggregating, grouping, merging, join operations

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

## pandas data structures: Series

A Series is a 1-D object containing

-   a sequence of values
-   and an associated array of data labels (its **index**)

In [3]:
obj = pd.Series([1, 2, 3, 4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
obj.values

array([1, 2, 3, 4])

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

We can also have labels for each data point

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

### Using Numpy-like operations

Filtering with a boolean array, scalar multiplication, or applying math functions

In [10]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2 * 2 + np.exp(obj2)

d      62.598150
b    1110.633158
a      -9.993262
c      26.085537
dtype: float64

### Converting from other data structures

From a dictionary

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
# obj3
# np.sum([sdata[k] for k in sdata])
obj3.sum()

127000

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### Data alignment in Series objects

pandas automatically aligns by index label

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

## pandas data structure: DataFrame

-   A DataFrame represents a rectangular table of data
-   Has both rows and columns, which can have different types

Many ways to construct a DataFrame, but most commonly from a dict or from Numpy arrays

In [21]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

We can pass columns explicitly and if they are not found in the dict, missing values will be used

In [22]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                        index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

### Retrieving columns and rows

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
# frame2['state']
# frame2['1year'] = np.zeros(6)
# frame2

       year   state  pop debt  1year
one    2000    Ohio  1.5  NaN    0.0
two    2001    Ohio  1.7  NaN    0.0
three  2002    Ohio  3.6  NaN    0.0
four   2001  Nevada  2.4  NaN    0.0
five   2002  Nevada  2.9  NaN    0.0
six    2003  Nevada  3.2  NaN    0.0

In [30]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Retrieving rows can be done with the `loc` keyword

In [32]:
type(frame2.loc['three'])

pandas.core.series.Series

### Modifying columns and rows

In [33]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  1year
one    2000    Ohio  1.5  16.5    0.0
two    2001    Ohio  1.7  16.5    0.0
three  2002    Ohio  3.6  16.5    0.0
four   2001  Nevada  2.4  16.5    0.0
five   2002  Nevada  2.9  16.5    0.0
six    2003  Nevada  3.2  16.5    0.0

In [36]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt  1year
one    2000    Ohio  1.5   0.0    0.0
two    2001    Ohio  1.7   1.0    0.0
three  2002    Ohio  3.6   2.0    0.0
four   2001  Nevada  2.4   3.0    0.0
five   2002  Nevada  2.9   4.0    0.0
six    2003  Nevada  3.2   5.0    0.0

If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2.loc[val.index, 'debt'] = val
frame2

       year   state  pop  debt  1year
one    2000    Ohio  1.5   0.0    0.0
two    2001    Ohio  1.7  -1.2    0.0
three  2002    Ohio  3.6   2.0    0.0
four   2001  Nevada  2.4  -1.5    0.0
five   2002  Nevada  2.9  -1.7    0.0
six    2003  Nevada  3.2   5.0    0.0

Assigning a column that doesn't exist will create a new column

In [40]:
frame2['eastern'] = (frame2.state == 'Ohio')
frame2

       year   state  pop  debt  1year  eastern
one    2000    Ohio  1.5   0.0    0.0     True
two    2001    Ohio  1.7  -1.2    0.0     True
three  2002    Ohio  3.6   2.0    0.0     True
four   2001  Nevada  2.4  -1.5    0.0    False
five   2002  Nevada  2.9  -1.7    0.0    False
six    2003  Nevada  3.2   5.0    0.0    False

### Indexing options

| Type|Notes|
|---|---|
| df[val]|Select single column or sequence of columns from the DataFrame|
| df.loc[val]|Selects single row or subset of rows from the DataFrame by label|
| df.loc[:, val]|Selects single column or subset of columns by label|
| df.loc[val1, val2]|Select both rows and columns by label|
| df.iloc[where]|Selects single row or subset of rows from the DataFrame by integer position|
| df.iloc[:, where]|Selects columns by integer position|
| df.iloc[where<sub>i</sub>, where<sub>j</sub>]|Select both rows and columns by integer position|
| df.at[label<sub>i</sub>, label<sub>j</sub>]|Select a single scalar value by row and column label|
| df.iat[i, j]|Select a single scalar value by row and column position (integers)|
| reindex methods|Select either rows or columns by labels|
| get<sub>value</sub>, set<sub>value</sub> methods|Select single value by row and column label|

## ☛ Hands-on exercises

Let's read in a dataset of the [NCDC storm event database for 2019](https://www.ncei.noaa.gov/access/metadata/landing-page/bin/iso?id=gov.noaa.ncdc:C00510)

In [42]:
storms = pd.read_csv("https://www.ncei.noaa.gov/pub/data/swdi/stormevents/csvfiles/StormEvents_locations-ftp_v1.0_d2021_c20230317.csv.gz")
storms.head()

,YEARMONTH,EPISODE_ID,EVENT_ID,LOCATION_INDEX,RANGE,AZIMUTH,LOCATION,LATITUDE,LONGITUDE,LAT2,LON2
0,202104,156920,948472,1,36.38,SSE,EDGEWATER,28.5400,-80.5700,2832400,8034200
1,202104,156920,948473,1,3.57,WSW,CAPE CANAVERAL,28.3587,-80.6535,2821522,8039210
2,202104,156920,948475,1,2.80,WNW,MELBOURNE,28.1000,-80.6400,286000,8038400
3,202104,156920,948476,1,11.20,N,CAPE CANAVERAL,28.5400,-80.5700,2832400,8034200
4,202104,156920,948477,1,1.40,ESE,VALKARIA,27.9600,-80.5300,2757600,8031800

How many storms were in the database for 2019?

In [49]:
len(storms)
# storms.count()
# storms.shape

53189

Find at least two ways to select the `Location` column

In [52]:
storms.LOCATION
storms.loc[:, 'LOCATION']

0                  EDGEWATER
1             CAPE CANAVERAL
2                  MELBOURNE
3             CAPE CANAVERAL
4                   VALKARIA
                ...
53184                HAMMOND
53185               HIGHLAND
53186               HIGHLAND
53187                HAMMOND
53188    HARRISON-DEVER CRIB
Name: LOCATION, Length: 53189, dtype: object

Find all rows where the azimuth is North

Convert the `Azimuth` data to true north-based angles (see this [table](https://i.imgur.com/38MwlZY.png))

Find all rows where `Range` is greater than 2 and `Location` starts with the letter `C`

Convert the azimuth from degrees to radians ($2 \pi / 180$)

Create a new `DataFrame` that contains only the rows with an odd index value (i.e., 1, 3, 5, &#x2026;)

Delete all rows with south azimuth

Delete the `LOCATION_INDEX` column

What months had NW azimuth?

What are the average latitude and longitude locations?

What is the variance of the range of the storms?

What month was maximum range observed?

Look at the `to_csv` function and save a new CSV file with the storms events north of 42°